In [55]:
import pandas as pd

In [56]:
df = pd.read_csv("titanic_data.csv")

In [57]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   age          713 non-null    float64
 4   sibsp        889 non-null    int64
 5   parch        889 non-null    int64
 6   fare         889 non-null    float64
 7   embarked     887 non-null    object
 8   class        889 non-null    object
 9   who          889 non-null    object
 10  adult_male   889 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  887 non-null    object
 13  alive        889 non-null    object
 14  alone        889 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.2+ KB

In [59]:
df.shape

(889, 15)

In [60]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            176
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           686
embark_town      2
alive            0
alone            0
dtype: int64

In [61]:
MissingCount = df.isnull().sum()

In [62]:
MissingCount[['age', 'deck']]

age     176
deck    686
dtype: int64

In [64]:
df.dropna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
869,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
870,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
877,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
887,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [66]:
df.dropna(inplace=True)

In [67]:
df.shape

(182, 15)

In [68]:
df_cleaned = df

In [69]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [70]:
df.shape

(182, 15)

In [71]:
survivors_df = df.groupby(['pclass'])['survived'].agg('sum')

In [72]:
survivors_df

pclass
1    106
2     12
3      5
Name: survived, dtype: int64

Above are the numbers that show how many survived in each class
.

In [73]:
town_fare_mean = df.groupby('embark_town')['fare'].mean()

In [85]:
(town_fare_mean)

embark_town
Cherbourg      103.342503
Queenstown      90.000000
Southampton     64.922862
Name: fare, dtype: float64

In [75]:
town_sex_fare_mean = df.groupby(['embark_town', 'sex'])['fare'].mean()

In [84]:
(town_sex_fare_mean)

embark_town  sex
Cherbourg    female    104.169609
             male      102.435355
Queenstown   female     90.000000
             male       90.000000
Southampton  female     79.251179
             male       52.674461
Name: fare, dtype: float64

In [81]:
town_sex_stats = df.groupby(['embark_town', 'sex']).agg({'fare': 'mean', 'age': 'mean'})

In [83]:
(town_sex_stats)

                          fare        age
embark_town sex
Cherbourg   female  104.169609  35.352941
            male    102.435355  39.774194
Queenstown  female   90.000000  33.000000
            male     90.000000  44.000000
Southampton female   79.251179  30.952830
            male     52.674461  37.595484